Strogino/src/Catalogs/ДополненияУсловийОтбора/ДополненияУсловийОтбора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДополненияУсловийОтбора</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбъекта</name>
    <type>
      <types>CatalogRef.ВидыОбъектовМ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяНабораДанных</name>
    <type>
      <types>DefinedType.СтрокаИменования</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОшибки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПоляЗапроса</name>
    <comment>Используется для более быстрого заполнения схемы компоновки данных</comment>
    <attributes>
      <name>Поле</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКДанным</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Заголовок</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкаСвязиСОбъектом</name>
    <attributes>
      <name>ИсточникСвязи</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеИсточник</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеПриемник</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеСвязи</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Strogino/src/Catalogs/ДополненияУсловийОтбора/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура КонструкторЗапроса(Команда)
	
	Попытка
		Конструктор = Новый КонструкторЗапроса;
	Исключение
		Предупреждение( "Конструктор запросов доступен только в режиме запуска ""толстый клиент""." );
		Возврат;
	КонецПопытки;
	
	Конструктор.РежимКомпоновкиДанных = Истина;
	Конструктор.АвтоДобавлениеПредставлений = Ложь;
	
	Если Не ПустаяСтрока( Объект.ТекстЗапроса ) Тогда
		Конструктор.Текст = Объект.ТекстЗапроса;
	КонецЕсли;
	
	Если Конструктор.ОткрытьМодально() = Истина Тогда
		
		Объект.ТекстЗапроса = Конструктор.Текст;
		
		ТекстЗапросаПриИзменении( Элементы.ТекстЗапроса );
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяНабораДанныхПриИзменении(Элемент)
	ИмяНабораДанныхПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИмяНабораДанныхПриИзмененииНаСервере()
	
	ОбъектКакОбъект = РеквизитФормыВЗначение( "Объект" );
	
	Если ПустаяСтрока( Объект.ИмяНабораДанных ) ИЛИ Не ОбъектКакОбъект.ЭтоКорректноеИмя( Объект.ИмяНабораДанных ) Тогда
		
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.УстановитьДанные( Объект.ИмяНабораДанных );
		СообщениеПользователю.Текст = "Имя набора данных не является корректным именем";
		СообщениеПользователю.Сообщить();
		
	КонецЕсли;
	
	ОбновитьСписокВыбораВыраженияПриемника();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстЗапросаПриИзменении(Элемент)
	ТекстЗапросаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТекстЗапросаПриИзмененииНаСервере()
	
	ОбновитьСписокВыбораВыраженияПриемника();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОбъектаПриИзменении(Элемент)
	ВидОбъектаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВидОбъектаПриИзмененииНаСервере()
	
	ОбновитьСписокВыбораВыраженияИсточника();
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	НаименованиеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура НаименованиеПриИзмененииНаСервере()
	
	ОбновитьСписокВыбораВыраженияПриемника();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьСписокВыбораВыраженияИсточника();
	ОбновитьСписокВыбораВыраженияПриемника();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокВыбораВыраженияИсточника()
	
	СписокВыбораИсточникаСвязи = Элементы.НастройкаСвязиСОбъектомИсточникСвязи.СписокВыбора;
	СписокВыбораИсточникаСвязи.Очистить();
	
	СпискиВыбораВыраженийИсточника = Новый Структура;
	
	Если ЗначениеЗаполнено( Объект.ВидОбъекта ) Тогда
		
		СтруктураТаблицВидаОбъекта = СвязиИОтборы_Привилегированный.СформироватьСтруктуруВнешнихИсточниковДанныхПоВидуОбъекта( Объект.ВидОбъекта );
		
		Если СтруктураТаблицВидаОбъекта <> Неопределено Тогда
			
			ИмяСтруктурыШапкиОбъекта = "ТаблицаШапкаОбъекта";
			ИмяСтруктурыСинонимовТЧ = "СинонимыТабличныхЧастей";
			
			// обойдем структуру таблиц вида объекта
			Для Каждого КлючИЗначение Из СтруктураТаблицВидаОбъекта Цикл
				
				// структура синонимов пропускаем
				Если КлючИЗначение.Ключ = ИмяСтруктурыСинонимовТЧ Тогда
					Продолжить;
				КонецЕсли;
				
				// для шапки и ТЧ принцип формирования списков выбора немножко отличается
				Если КлючИЗначение.Ключ = ИмяСтруктурыШапкиОбъекта Тогда
					
					ИмяСпискаВыбора = "Шапка";
					ДополнениеКИмениКолонки = "";
					
				Иначе
					
					ИмяСпискаВыбора = КлючИЗначение.Ключ;
					ДополнениеКИмениКолонки = КлючИЗначение.Ключ + "." + КлючИЗначение.Ключ + "__";
					
					// ТЧ также добавим в список выбора источников связи
					СписокВыбораИсточникаСвязи.Добавить( КлючИЗначение.Ключ, КлючИЗначение.Ключ );
					
				КонецЕсли;
				
				// сформируем список выбора для текущей таблицы
				СписокВыбораВыраженийИсточникаТекущейТаблицы = Новый СписокЗначений;
				
				Для Каждого КолонкаТаблицы Из КлючИЗначение.Значение.Колонки Цикл
					СписокВыбораВыраженийИсточникаТекущейТаблицы.Добавить( ДополнениеКИмениКолонки + КолонкаТаблицы.Имя, ДополнениеКИмениКолонки + КолонкаТаблицы.Имя );
				КонецЦикла;
				
				// добавим сформированный списк в общий список
				СпискиВыбораВыраженийИсточника.Вставить( ИмяСпискаВыбора, СписокВыбораВыраженийИсточникаТекущейТаблицы );
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокВыбораВыраженияПриемника()
	
	СписокВыбора = Элементы.НастройкаСвязиСОбъектомВыражениеПриемник.СписокВыбора;
	СписокВыбора.Очистить();
	
	// обновим ТЧ Поля Запроса
	ОбъектКакОбъект = РеквизитФормыВЗначение( "Объект" );
	ОбъектКакОбъект.ПерезаполнитьПоляЗапроса();
	ЗначениеВРеквизитФормы( ОбъектКакОбъект, "Объект" );
	
	Для Каждого ПолеЗапроса Из Объект.ПоляЗапроса Цикл
		
		ПутьКДаннымПоля = Неопределено;
		
		Если ПолеЗапроса.Свойство( "ПутьКДанным", ПутьКДаннымПоля ) Тогда
			СписокВыбора.Добавить( ПутьКДаннымПоля, ПутьКДаннымПоля );
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСвязиСОбъектомПриАктивизацииЯчейки(Элемент)
	
	// если был переход в колонку Выражение Источник, то для нужно обновить список выбора
	Если Элементы.НастройкаСвязиСОбъектом.ТекущийЭлемент = Элементы.НастройкаСвязиСОбъектомВыражениеИсточник Тогда
		
		СписокВыбора = Элементы.НастройкаСвязиСОбъектомВыражениеИсточник.СписокВыбора;
		СписокВыбора.Очистить();
		
		// определим имя списка выбора через имя таблицы источника
		ИмяСпискаВыбора = Неопределено;
		
		Элементы.НастройкаСвязиСОбъектом.ТекущиеДанные.Свойство( "ИсточникСвязи", ИмяСпискаВыбора );
		
		Если ИмяСпискаВыбора = "" Тогда
			ИмяСпискаВыбора = "Шапка";
		КонецЕсли;
		
		// получим новый список выбора
		НовыйСписокВыбора = Неопределено;
		
		Если СпискиВыбораВыраженийИсточника.Свойство( ИмяСпискаВыбора, НовыйСписокВыбора ) Тогда
			
			// если новый список выбора получен, то скопируем его в список выбора элемента формы
			Для Каждого ЗначениеСпискаВыбора Из НовыйСписокВыбора Цикл
				СписокВыбора.Добавить( ЗначениеСпискаВыбора.Значение, ЗначениеСпискаВыбора.Представление );
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
